docs/benchmarks/raw/l40s-2026-08-23/machine/bf16-4096-c32.txt
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7c64bbfe4b80>, trust_remote_code=False, seed=0, num_prompts=128, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4000, random_output_len=200, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=32, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/run2', result_filename='bf16-4096-c32.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-cabb13ee-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-23 08:54:23 [utils.py:90] Sampling input_len from [4000, 4000] and output_len from [200, 200]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
100%|██████████| 128/128 [01:24<00:00,  1.51it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     128       
Failed requests:                         0         
Maximum request concurrency:             32        
Benchmark duration (s):                  84.66     
Total input tokens:                      512000    
Total generated tokens:                  25600     
Request throughput (req/s):              1.51      
Output token throughput (tok/s):         302.39    
Peak output token throughput (tok/s):    640.00    
Peak concurrent requests:                36.00     
Total token throughput (tok/s):          6350.19   
---------------Time to First Token----------------
Mean TTFT (ms):                          2377.45   
Median TTFT (ms):                        1175.01   
P50 TTFT (ms):                           1175.01   
P90 TTFT (ms):                           7077.33   
P99 TTFT (ms):                           11516.66  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          93.77     
Median TPOT (ms):                        99.77     
P50 TPOT (ms):                           99.77     
P90 TPOT (ms):                           100.39    
P99 TPOT (ms):                           103.25    
---------------Inter-token Latency----------------
Mean ITL (ms):                           93.77     
Median ITL (ms):                         50.48     
P50 ITL (ms):                            50.48     
P90 ITL (ms):                            386.77    
P99 ITL (ms):                            398.89    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          21037.97  
Median E2EL (ms):                        21040.92  
P50 E2EL (ms):                           21040.92  
P90 E2EL (ms):                           26705.97  
P99 E2EL (ms):                           31174.77  
==================================================